12/data/attachments/5ad1a914332c9f73.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_65f8c294-a64a-4bc2-a466-5d184e4ae4e4</nif:username>
            <nif:friendToBeAdded>Seth_each_Friend_22764_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>